// Ойынның басталуы және пайдаланушыдан атын сұрау
let userName = prompt("Саяхатшы, атыңызды енгізіңіз: ");
alert(userName + ", қош келдіңіз! Сізді қызықты саяхат күтіп тұр. Ал, бірінші қадамға дайын болыңыз!");

// 1-қадам: Қиылыс жол
let firstChoice = prompt("Сіз қиылыста тап болдыңыз. Сіз \"солға\" немесе \"оңға\" барасыз ба?");
if (firstChoice.toLowerCase() == "солға") {
  alert("Сіз солға бұрылдыңыз. Жол бойында көне зират орналасқан екен. Жақындап барсаңыз, көріп тұрсыз: есік ашық, алайда ішке кіруге болмайды.");
} else if (firstChoice.toLowerCase() == "оңға") {
  alert("Сіз оңға бұрылдыңыз. Алдыңызда көкпеңбек орман. Ағаштар өте биік, бірақ ішіне кіру біртүрлі қорқынышты.");
} else {
  alert("Қате жауап! Өзіңізге қолайлы бағытты таңдаңыз: солға немесе оңға.");
}

// 2-қадам: Өзен
let secondChoice = prompt("Сіз өзенді көріп тұрсыз. Сіз салдың үстінен \"жүзесіз\" бе әлде \"қайық\" жасайсыз ба?");
if (secondChoice.toLowerCase() == "жүзіп") {
  alert("Сіз өзенді жүзіп өтпек болып шештіңіз. Өзен суы өте күшті, бірақ сіз жеңіспен өтіп, екінші жағалауға шықтыңыз.");
} else if (secondChoice.toLowerCase() == "қайық") {
  alert("Сіз өзеннен өту үшін өзіңіз қайық жасай бастадыңыз. Қайық жасаудың көптеген бөліктері болды, бірақ сіз жұмысты толықтай аяқтай алдыңыз. Өзеннен өту үшін сәтті қайықты пайдаландыңыз!");
} else {
  alert("Қате жауап! Қайбір тәсілді таңдаңыз: жүзіп өту немесе қайық жасау.");
}

// 3-қадам: Қазына сандығы
let thirdChoice = prompt("Сіз қазына сандығын таптыңыз. Сіз оны \"ашасыз\"  немесе \"тиіспейсіз\" бе?");
if (thirdChoice.toLowerCase() == "ашасыз") {
  alert("Сіз сандықты ашып, ішінен алтын, асыл тастар мен қымбат жібектерді табасыз. Құттықтаймыз, сіз қазынаны таптыңыз!");
} else if (thirdChoice.toLowerCase() == "тиіспейсіз") {
  alert("Сіз қазына сандығына жақындап, оны ашпайтын болдыңыз. Бірақ бір сәтте сіздің үстіңізге тұзақ түсіп, бұл әрекет сізді қатты қорқытып жіберді!");
} else {
  alert("Қате жауап! Сандықты ашуға немесе тиіспеуге шешім қабылдаңыз.");
}

// Ойынның соңғы нәтижесі
alert("Саяхатыңыз аяқталды. Сіздің шешімдеріңізге негізделген нәтижелер: " + 
      (thirdChoice.toLowerCase() === "ашасыз" ? "Құттықтаймыз, сіз қазынаны таптыңыз!" : "Өкінішке орай, сіз тұзаққа түстіңіз."));
